In [1]:
import pandas as pd
from sqlalchemy import create_engine
import numpy as np
import os
import pygal
import matplotlib.pyplot as plt
import sqlalchemy
from datetime import datetime,date,time,timedelta
import calendar
import math
from os import remove

In [2]:
df2=pd.read_excel('/Users/Laura/Desktop/COTRAPSA/Analisis facturas/Facturas_sin_mano_obra.xlsx')

df2 = df2[df2.Estatus=='Emitida']
df2.reset_index(inplace=True,drop=True)

In [3]:
ruta='/Users/Laura/Desktop/COTRAPSA/Analisis facturas/Facturas con mano de obra/tratadas'

lst_arch = ([x for x in os.listdir(ruta) if x[-4:]=='xlsx'])
lst_arch

['Facturas_Bimbo.xlsx', 'Facturas_Barcel.xlsx', 'Facturas_Alpura.xlsx']

In [4]:
lst_df = []
for arch in lst_arch:
    df = pd.read_excel(os.path.join(ruta,arch),encoding='iso-8859-1')
    lst_df.append(df)

In [5]:
lst_df[0].shape

(281, 7)

In [6]:
lst_df[0] = lst_df[0] [lst_df[0]['Fecha_p'].isin(['201801','201802','201803','201804','201805','201806','201807','201808','201809','201810','201811','201812'])]
lst_df[0].reset_index(drop=True,inplace=True)

In [7]:
lst_df[1] = lst_df[1] [lst_df[1]['Fecha_pago'].isin(['201801','201802','201803','201804','201805','201806','201807','201808','201809','201810','201811','201812'])]
lst_df[1].reset_index(drop=True,inplace=True)

In [8]:
lst_df[2] = lst_df[2] [lst_df[2]['Fecha_pago'].isin(['201801','201802','201803','201804','201805','201806','201807','201808','201809','201810','201811','201812'])]
lst_df[2].reset_index(drop=True,inplace=True)

In [9]:
df2=df2[df2['Fecha_de_p'].isin(['201801','201802','201803','201804','201805','201806','201807','201808','201809','201810','201811','201812'])]
df2.reset_index(drop=True,inplace=True)

In [10]:
lst_df[1].head()

,Nombre,Fecha_elab,Fecha_entrega,Fecha_pago,Subtotal,Importe_total,Método_pago
0,BARCEL S.A. DE C,201803,201803,201804,220,255.20,PPD
1,BARCEL S.A. DE C,201803,201803,201804,5495,6374.20,PPD
2,BARCEL S.A. DE C,201803,201803,201803,7264,8426.24,PPD
3,BARCEL S.A. DE C,201811,201811,201812,34848,40423.68,PPD
4,BARCEL S.A. DE C,201810,201810,201811,45516,52798.56,PPD

In [11]:
lst_df[2].head()

,Nombre,Fecha_elabo,Fecha_entr,Fecha_pago,Subtotal,Importe_total,Método_pago
0,TRANSPORTADO,201803,201803,201804,25202.0,29234.32,PPD
1,TRANSPORTADO,201810,201810,201811,25202.0,29234.32,PPD
2,TRANSPORTADO,201802,201802,201804,25202.0,29234.32,PPD
3,TRANSPORTADO,201803,201803,201804,25202.0,29234.32,PPD
4,TRANSPORTADO,201810,201810,201811,25202.0,29234.32,PPD

In [12]:
df2.head()

,Nombre,Estatus,Fecha_de_elabor,Fecha_de_entr,Fecha_de_p,Fecha_de_cance,Subtotal,Importe,Método_pago
0,"MUNDO GLOBAL DE REMOLQUES, S.A. DE C.V.",Emitida,2018-12-19,2018-12-19,201812,NaN,4042.11,4688.85,PPD
1,"MUNDO GLOBAL DE REMOLQUES, S.A. DE C.V.",Emitida,2018-12-19,2018-12-19,201812,NaN,3619.80,4198.97,PPD
2,"MUNDO GLOBAL DE REMOLQUES, S.A. DE C.V.",Emitida,2018-12-19,2018-12-19,201812,NaN,24614.60,28552.90,PPD
3,"MUNDO GLOBAL DE REMOLQUES, S.A. DE C.V.",Emitida,2018-12-19,2018-12-19,201812,NaN,17354.90,20131.70,PPD
4,"MUNDO GLOBAL DE REMOLQUES, S.A. DE C.V.",Emitida,2018-12-19,2018-12-19,201812,NaN,28113.70,32611.90,PPD

In [13]:
aux=lst_df[0][['Fecha_p','Importe_total']].groupby('Fecha_p').sum()
aux.sort_values('Fecha_p',ascending=True,inplace=True)
aux

         Importe_total
Fecha_p
201801        23718.52
201802       156091.92
201803        28134.64
201804        96655.84
201805       164780.32
201806       176062.48
201807       122433.36
201808        39696.36
201809       142547.76
201810        74815.36
201811       110459.84
201812        51831.12

In [14]:
aux2=lst_df[1][['Fecha_pago','Importe_total']].groupby('Fecha_pago').sum()
aux2.sort_values('Fecha_pago',ascending=True,inplace=True)
aux2

            Importe_total
Fecha_pago
201803          103009.16
201804           32818.72
201807            3120.40
201808          129868.96
201810           76272.32
201811           61299.04
201812          117531.20

In [15]:
aux3=lst_df[2][['Fecha_pago','Importe_total']].groupby('Fecha_pago').sum()
aux3.sort_values('Fecha_pago',ascending=True,inplace=True)
aux3

            Importe_total
Fecha_pago
201804          204640.24
201805          146171.60
201806           29234.32
201807           29234.32
201811          146171.60

In [16]:
aux4=df2[['Fecha_de_p','Importe']].groupby('Fecha_de_p').sum()
aux4.sort_values('Fecha_de_p',ascending=True,inplace=True)
aux4

               Importe
Fecha_de_p
201801       401272.71
201802       357173.46
201803       534372.49
201804       604838.39
201805       507161.06
201806       477858.46
201807       384896.21
201808       741793.73
201809      2808612.53
201810       426235.54
201811       406434.19
201812       597485.55

In [17]:
line_chart = pygal.Bar()
line_chart.title = 'Facturas 2018'
line_chart.x_labels = aux4.index
line_chart.add('Bimbo',aux.Importe_total)
line_chart.add('Barcel',aux2.Importe_total)
line_chart.add('Alpura',aux3.Importe_total)
line_chart.add('Facturas sin mano obra',aux4.Importe)
line_chart.render_to_file('Facturas_2018.svg')

In [18]:
line_chart = pygal.Pie()
line_chart.title = 'Facturas 2018'
line_chart.x_labels = aux4.index
line_chart.add('Bimbo',aux.Importe_total)
line_chart.add('Barcel',aux2.Importe_total)
line_chart.add('Alpura',aux3.Importe_total)
line_chart.add('Facturas sin mano obra',aux4.Importe)
line_chart.render_to_file('Facturas_2018_Pie.svg')

In [20]:
line_chart = pygal.StackedLine(stack_from_top=True, fill=True)
line_chart.title = 'Facturas 2018'
line_chart.x_labels = aux4.index
line_chart.add('Bimbo',aux.Importe_total)
line_chart.add('Barcel',aux2.Importe_total)
line_chart.add('Alpura',aux3.Importe_total)
line_chart.add('Facturas sin mano obra',aux4.Importe)
line_chart.render_to_file('Facturas_2018_acum.svg')

In [22]:
line_chart = pygal.Line(stack_from_top=True)
line_chart.title = 'Facturas 2018'
line_chart.x_labels = aux4.index
line_chart.add('Bimbo',aux.Importe_total)
line_chart.add('Barcel',aux2.Importe_total)
line_chart.add('Alpura',aux3.Importe_total)
line_chart.add('Facturas sin mano obra',aux4.Importe)
line_chart.render_to_file('Facturas_2018_lineal.svg')